[
  {
    "name": "HTML",
    "icon": "fab fa-html5",
    "details": "Expert in HTML5, crafting clean, semantic, and accessible markup to build responsive, SEO-optimized websites.",
    "progress": "90"
  },
  {
    "name": "CSS",
    "icon": "fab fa-css3",
    "details": "Proficient in CSS, SCSS, and modern frameworks like Bootstrap, delivering visually stunning and responsive user interfaces.",
    "progress": "80"
  },
  {
    "name": "TypeScript",
    "icon": "fab fa-js",
    "details": "Skilled in TypeScript, leveraging static typing and OOP principles to develop scalable, maintainable, and robust web applications.",
    "progress": "75"
  },
  {
    "name": "C++",
    "icon": "fab fa-cuttlefish",
    "details": "Experienced in C++ programming, with a strong focus on object-oriented design, data structures, and high-performance algorithms.",
    "progress": "55"
  },
  {
    "name": "Python",
    "icon": "fab fa-python",
    "details": "Proficient in Python, utilizing its versatility for automation, data analysis, and web development with popular libraries and frameworks.",
    "progress": "50"
  },
  {
    "name": "Angular",
    "icon": "fab fa-angular",
    "details": "Experienced in Angular, building dynamic, single-page applications with modular components, services, and efficient routing.",
    "progress": "80"
  },
  {
    "name": "Linux",
    "icon": "fab fa-linux",
    "details": "Highly skilled in Linux environments, proficient in system administration, scripting, and development workflows.",
    "progress": "90"
  },
  {
    "name": "GitHub",
    "icon": "fab fa-github",
    "details": "Expert in GitHub, managing version control, collaborative workflows, and CI/CD pipelines for seamless project development.",
    "progress": "100"
  },
  {
    "name": "MongoDB",
    "icon": "fas fa-database",
    "details": "Proficient in MongoDB, designing scalable NoSQL databases, optimizing queries, and integrating with backend services for efficient data management.",
    "progress": "80"
  },
  {
    "name": "MySQL",
    "icon": "fas fa-database",
    "details": "Experienced in MySQL, designing relational database schemas, writing efficient queries, and managing large datasets for web applications.",
    "progress": "90"
  }
]
